In [10]:

import pandas as pd
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt
import chardet as ch
import os

In [36]:
def get_encoding(file):
    with open(file, 'rb') as f:
        result = ch.detect(f.read())
    return result['encoding']

In [38]:
data_list = ['/home/theghost001/Pictures/practice_with_H/data/travel_first_half - Travel.csv', '/home/theghost001/Pictures/practice_with_H/data/travel_second_half - Travel.csv']

In [39]:
for data in data_list:
    print(get_encoding(data))

ascii
ascii

In [41]:
data1 = pd.read_csv('/home/theghost001/Pictures/practice_with_H/data/travel_first_half - Travel.csv', encoding='ascii')
data2 = pd.read_csv('/home/theghost001/Pictures/practice_with_H/data/travel_second_half - Travel.csv', encoding='ascii')

In [ ]:
# for i in data_list:
#   try:
#     data1 = pd.read_csv(i, encoding=get_encoding(i))
#   except UnicodeDecodeError:
#     print("UnicodeDecodeError: Encountered issues with the encoding. Please check the data source or try specifying a different encoding.")

UnicodeDecodeError: Encountered issues with the encoding. Please check the data source or try specifying a different encoding.
UnicodeDecodeError: Encountered issues with the encoding. Please check the data source or try specifying a different encoding.

In [42]:
data1.head()

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting
0,200000,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3
1,200001,0,49.0,Company Invited,1,14.0,Salaried,Male,3
2,200002,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3
3,200003,0,33.0,Company Invited,1,9.0,Salaried,Female,2
4,200004,0,NaN,Self Enquiry,1,8.0,Small Business,Male,2

In [43]:
data2.head()

,CustomerID,NumberOfFollowups,ProductPitched,PreferredPropertyStar,MaritalStatus,NumberOfTrips,Passport,PitchSatisfactionScore,OwnCar,NumberOfChildrenVisiting,Designation,MonthlyIncome
0,200000,3.0,Deluxe,3.0,Single,1.0,1,2,1,0.0,Manager,20993.0
1,200001,4.0,Deluxe,4.0,Divorced,2.0,0,3,1,2.0,Manager,20130.0
2,200002,4.0,Basic,3.0,Single,7.0,1,3,0,0.0,Executive,17090.0
3,200003,3.0,Basic,3.0,Divorced,2.0,1,5,1,1.0,Executive,17909.0
4,200004,3.0,Basic,4.0,Divorced,1.0,0,5,1,0.0,Executive,18468.0

In [61]:
from datetime import datetime,timedelta
now = datetime.now()
print(now)
startDate = datetime(2010,1,1)
endDate = datetime(2015,12,31)
timeBetweenDates = endDate - startDate
print('time betwen dates is {}'.format(timeBetweenDates))
daysBetweenDates = timeBetweenDates.days
print('days between dates is {}'.format(daysBetweenDates))
#randomNumberOfDays = np.random.randint(0,daysBetweenDates)
# randomNumberOfDays = int(np.random.rand() * daysBetweenDates)
# randomDate = startDate + timedelta(days=randomNumberOfDays)
# data1['DateOfBirth'] = pd.to_datetime(randomDate)

2025-01-17 12:23:48.641347
time betwen dates is 2190 days, 0:00:00
days between dates is 2190

In [67]:
for index, row in data1.iterrows():
    randomNumberOfDays = int(np.random.rand() * daysBetweenDates)
    randomDate = startDate + timedelta(days=randomNumberOfDays)
    data1.loc[index, 'DateofBirth'] = randomDate

In [68]:
data1.head(5)

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting,DateOfBirth,DateofBirth
0,200000,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3,2011-03-18,2014-04-25
1,200001,0,49.0,Company Invited,1,14.0,Salaried,Male,3,2011-03-18,2011-05-17
2,200002,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3,2011-03-18,2012-04-21
3,200003,0,33.0,Company Invited,1,9.0,Salaried,Female,2,2011-03-18,2011-02-06
4,200004,0,NaN,Self Enquiry,1,8.0,Small Business,Male,2,2011-03-18,2015-10-05

In [69]:
data1.sample(15)

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting,DateOfBirth,DateofBirth
1007,201007,1,29.0,Company Invited,1,20.0,Salaried,Female,2,2011-03-18,2014-04-26
2039,202039,0,36.0,Company Invited,3,14.0,Salaried,Male,3,2011-03-18,2013-03-17
4414,204414,0,33.0,Self Enquiry,1,16.0,Salaried,Female,4,2011-03-18,2012-02-11
4070,204070,0,52.0,Self Enquiry,1,14.0,Small Business,Male,3,2011-03-18,2011-12-13
1310,201310,0,58.0,Company Invited,1,21.0,Salaried,Male,2,2011-03-18,2013-12-18
1838,201838,1,40.0,Self Enquiry,3,28.0,Small Business,Male,3,2011-03-18,2012-01-30
2769,202769,0,32.0,Company Invited,1,14.0,Salaried,Female,3,2011-03-18,2014-11-26
3961,203961,0,38.0,Self Enquiry,1,26.0,Salaried,Male,4,2011-03-18,2014-03-21
1932,201932,0,34.0,Self Enquiry,3,27.0,Salaried,Male,3,2011-03-18,2014-05-02
4273,204273,0,37.0,Company Invited,3,10.0,Small Business,Male,3,2011-03-18,2014-08-25
473,200473,0,49.0,Self Enquiry,1,24.0,Salaried,Male,2,2011-03-18,2011-10-29
604,200604,0,42.0,Self Enquiry,1,NaN,Salaried,Male,3,2011-03-18,2010-01-25
1322,201322,0,46.0,Self Enquiry,1,8.0,Salaried,Male,2,2011-03-18,2010-01-10
2148,202148,0,48.0,Self Enquiry,1,26.0,Small Business,Male,2,2011-03-18,2010-01-16
4882,204882,1,37.0,Self Enquiry,2,20.0,Salaried,Male,3,2011-03-18,2015-02-26

In [70]:
data1.tail(5)

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting,DateOfBirth,DateofBirth
4883,204883,1,49.0,Self Enquiry,3,9.0,Small Business,Male,3,2011-03-18,2014-01-06
4884,204884,1,28.0,Company Invited,1,31.0,Salaried,Male,4,2011-03-18,2010-11-14
4885,204885,1,52.0,Self Enquiry,3,17.0,Salaried,Female,4,2011-03-18,2013-03-07
4886,204886,1,19.0,Self Enquiry,3,16.0,Small Business,Male,3,2011-03-18,2013-04-12
4887,204887,1,36.0,Self Enquiry,1,14.0,Salaried,Male,4,2011-03-18,2011-02-23